#!/usr/bin/env python3.9
# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

from re import template


ip_net = input("Введите IP-сети в формате: 10.1.1.0/24 ")
ip,mask = ip_net.split("/")

oct1, oct2, oct3, oct4 = ip.split(".")
oct1, oct2, oct3, oct4 = int(oct1), int(oct2), int(oct3), int(oct4)
oct12, oct22, oct32, oct42 = bin(int(oct1))[2:], bin(int(oct1))[2:], bin(int(oct1))[2:], bin(int(oct1))[2:] 
mask2 = "1" * int(mask) + "0" * (32 - int(mask))
m12 = mask2[:8]
m22 = mask2[8:16]
m32 = mask2[16:24]
m42 = mask2[24:]
m1 = int(m12,2)
m2 = int(m22,2)
m3 = int(m32,2)
m4 = int(m42,2)

template = ('Network:',
            '{:<9} {:<9} {:<9} {:<9}',
            '{:08b}  {:08b}  {:08b}  {:08b}',
            'Mask:',
            '/{}',
            '{:<9} {:<9} {:<9} {:<9}',
            '{:8}  {:8}  {:8}  {:8}',
            )

print('\n'.join(template).format(oct1, oct2, oct3, oct4, oct1, oct2, oct3, oct4, mask, m1, m2, m3, m4, m12, m22, m32, m42))


